In [1]:
import pandas as pd 
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler,LabelEncoder
import pickle

In [2]:
## Load the dataset
data=pd.read_csv("Churn_Modelling.csv")

In [3]:
data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [ ]:
## We don't require first three row so we r;emove it using df.drop()
data=data.drop(["RowNumber","CustomerId","Surname"],axis=1)

In [6]:
data.head()

   CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619    France  Female  ...               1        101348.88       1
1          608     Spain  Female  ...               1        112542.58       0
2          502    France  Female  ...               0        113931.57       1
3          699    France  Female  ...               0         93826.63       0
4          850     Spain  Female  ...               1         79084.10       0

[5 rows x 11 columns]

In [ ]:
## Here are the two categorical variable which are gender and geography 
## Encode categorical variable 
## Label encoder check for the unique values in the data frame and assign unique values of different classes
label_gender_encoder=LabelEncoder()
data["Gender"]=label_gender_encoder.fit_transform(data["Gender"])
data.head()

   CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619    France       0  ...               1        101348.88       1
1          608     Spain       0  ...               1        112542.58       0
2          502    France       0  ...               0        113931.57       1
3          699    France       0  ...               0         93826.63       0
4          850     Spain       0  ...               1         79084.10       0

[5 rows x 11 columns]

In [10]:
## OneHotEncoder is used to encode the city name 
from sklearn.preprocessing import OneHotEncoder
## Create encoder instance 
## Sparse=False returns array instaed of sparse matrix.
onehot_encoder_geo=OneHotEncoder()
## Reshape required as input must be 2D 
Geo_encoded=onehot_encoder_geo.fit_transform(data[["Geography"]])

In [ ]:
## This create a sparse Matrix and we have to convert it into array 
Geo_encoded

<Compressed Sparse Row sparse matrix of dtype 'float64'
	with 10000 stored elements and shape (10000, 3)>

In [15]:
Geo_encoded=Geo_encoded.toarray()

In [16]:
## Make dataframe from it 
Geo_encoded_df=pd.DataFrame(Geo_encoded,columns=onehot_encoder_geo.get_feature_names_out(["Geography"]))
## Then concatenate with the original dataframe
df=pd.concat([data,Geo_encoded_df],axis=1)

In [17]:
df.head()

   CreditScore Geography  ...  Geography_Germany  Geography_Spain
0          619    France  ...                0.0              0.0
1          608     Spain  ...                0.0              1.0
2          502    France  ...                0.0              0.0
3          699    France  ...                0.0              0.0
4          850     Spain  ...                0.0              1.0

[5 rows x 14 columns]

In [19]:
df=df.drop(["Geography"],axis=1)

In [20]:
df.head()

   CreditScore  Gender  ...  Geography_Germany  Geography_Spain
0          619       0  ...                0.0              0.0
1          608       0  ...                0.0              1.0
2          502       0  ...                0.0              0.0
3          699       0  ...                0.0              0.0
4          850       0  ...                0.0              1.0

[5 rows x 13 columns]

In [22]:
## We have to save model in the form of pickle file as it is required in the 
## Modeldeployement Consistent transformation at interference time and avoid re-fitting 
import pickle
with open("label_gender_encoder.pkl","wb") as file:
    pickle.dump(label_gender_encoder,file)


with open("onehot_encoder_geo.pkl","wb") as file:
    pickle.dump(onehot_encoder_geo,file)

In [ ]:
## Decide the dataset into Independent and dependent features
X=df.drop("Exited",axis=1)## Independent
y=df["Exited"]## Dependent

In [24]:
## Split the Data in training and testing sets
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=42)

## Scale the features
scaler=StandardScaler()
X_train=scaler.fit_transform(X_train)
X_test=scaler.transform(X_test)

In [26]:
with open ("scaler.pkl","wb") as file:
    pickle.dump(scaler,file)